## drop_duplicates

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Col1" : [1,2,3,3,3,3],
    "Col2" : [10,20,30,30,30,30]
})
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     3    30
4     3    30
5     3    30

In [3]:
df.drop_duplicates()

   Col1  Col2
0     1    10
1     2    20
2     3    30

In [4]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     3    30
4     3    30
5     3    30

In [5]:
df.drop_duplicates(keep="last",inplace=False)

   Col1  Col2
0     1    10
1     2    20
5     3    30

In [6]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     3    30
4     3    30
5     3    30

In [7]:
df.drop_duplicates(subset=["Col1"], keep="last",inplace=True)

In [8]:
df

   Col1  Col2
0     1    10
1     2    20
5     3    30